test/perf/results/batch_rtt50_c200.txt
==============================================================
Endpoint : http://127.0.0.1:20080/api/v1/filter/batch
RTT      : 50ms    Conns: 200   Threads: 16   Duration: 30s
Time     : 2026-05-12T16:35:05+08:00
==============================================================
Running 30s test @ http://127.0.0.1:20080/api/v1/filter/batch
  16 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   458.73ms  286.96ms   2.12s    91.17%
    Req/Sec    30.09     18.19   168.00     61.63%
  Latency Distribution
     50%  388.02ms
     75%  509.62ms
     90%  688.41ms
     99%    2.07s 
  14080 requests in 31.77s, 68.58MB read
Requests/sec:    443.21
Transfer/sec:      2.16MB